#include "key.h"

/***************************************************************
** 功能：     按键硬件初始化
** 参数：	  无参数
** 返回值：   无
****************************************************************/
u8   VCState;  //wya 定义一个语音控制状态全局变量


void KEY_Init(void)
{
	  GPIOB->MODER&= 0X00FFFFFF;  //PB12~PB15设置成输入(按键)
	  GPIOB->PUPDR|= 0X55000000;  //PB12~PB15设置上拉 (按键) 
	
	  GPIOB->MODER&= 0XFFFF00FF;  //PB4~PB7设置成输入,做为语音模块SU03T输出状态监测引脚
	  GPIOB->PUPDR|= 0X00005500;  //PB4~PB7设置上拉  	
	
//    GPIOB->CRH&=0X0000FFFF; 	  
//	GPIOB->CRH|=0X88880000; //PB12~PB15设置成输入
////	GPIOB->ODR|=0xf000;	    //PB12~PB15设置上拉    //sfq  输入无需设置
}
